import cn.hutool.json.JSONArray;
import cn.hutool.json.JSONObject;
import cn.hutool.json.JSONUtil;

import java.io.File;

public class TTT {
    //重命名图片信息
    public static void main(String[] args) throws Exception {
    }

    public static void renameTo() throws Exception {
        File file = new File("D:\\ty20200912\\人脸图片文件");
        File[] files = file.listFiles();
        for (File f : files) {
            String name = f.getName().replace(".jpg", "");
            if (name.contains("_")) {
                String[] ss = name.split("_");
                System.out.println(ss[1]);
                System.out.println(f.renameTo(new File(f.getParent() + "\\" + ss[1] + ".jpg")));
            }
        }
    }

    public static void renameTo1() throws Exception {

        String json = "[\n" +
                "{\"no\":\"TY00001\",\"name\":\"陈波\"},\n" +
                "{\"no\":\"TY00002\",\"name\":\"金美兰\"},\n" +
                "{\"no\":\"TY00003\",\"name\":\"陈伟\"},\n" +
                "{\"no\":\"TY00004\",\"name\":\"陈秋生\"},\n" +
                "{\"no\":\"TY00005\",\"name\":\"何仁易\"},\n" +
                "{\"no\":\"TY00006\",\"name\":\"方卫华\"},\n" +
                "{\"no\":\"TY00007\",\"name\":\"陈秋水\"},\n" +
                "{\"no\":\"TY00008\",\"name\":\"陈卫平\"},\n" +
                "{\"no\":\"TY00009\",\"name\":\"陈鹏\"},\n" +
                "{\"no\":\"TY00010\",\"name\":\"聂玉光\"},\n" +
                "{\"no\":\"TY00011\",\"name\":\"糜火锋\"},\n" +
                "{\"no\":\"TY00012\",\"name\":\"陈卫锋\"},\n" +
                "{\"no\":\"TY00013\",\"name\":\"陈金凤\"},\n" +
                "{\"no\":\"TY00014\",\"name\":\"王扬威\"},\n" +
                "{\"no\":\"TY00015\",\"name\":\"程泉华\"},\n" +
                "{\"no\":\"TY00016\",\"name\":\"冯明海\"},\n" +
                "{\"no\":\"TY00017\",\"name\":\"汪有国\"},\n" +
                "{\"no\":\"TY00018\",\"name\":\"何炳辉\"},\n" +
                "{\"no\":\"TY00019\",\"name\":\"何巧珍\"},\n" +
                "{\"no\":\"TY00020\",\"name\":\"洪志超\"},\n" +
                "{\"no\":\"TY00021\",\"name\":\"方卫兵\"},\n" +
                "{\"no\":\"TY00022\",\"name\":\"苏阳阳\"},\n" +
                "{\"no\":\"TY00023\",\"name\":\"胡淑平\"},\n" +
                "{\"no\":\"TY00024\",\"name\":\"徐慧林\"},\n" +
                "{\"no\":\"TY00025\",\"name\":\"张世玉\"},\n" +
                "{\"no\":\"TY00026\",\"name\":\"刘三波\"},\n" +
                "{\"no\":\"TY00027\",\"name\":\"程怡敏\"},\n" +
                "{\"no\":\"TY00028\",\"name\":\"程征青\"},\n" +
                "{\"no\":\"TY00029\",\"name\":\"臧世荣\"},\n" +
                "{\"no\":\"TY00030\",\"name\":\"詹冬养\"},\n" +
                "{\"no\":\"TY00031\",\"name\":\"程后盛\"},\n" +
                "{\"no\":\"TY00032\",\"name\":\"刘太华\"},\n" +
                "{\"no\":\"TY00033\",\"name\":\"冯金平\"},\n" +
                "{\"no\":\"TY00034\",\"name\":\"王振宇\"},\n" +
                "{\"no\":\"TY00035\",\"name\":\"胡林港\"},\n" +
                "{\"no\":\"TY00036\",\"name\":\"张冬生\"},\n" +
                "{\"no\":\"TY00037\",\"name\":\"胡永星\"},\n" +
                "{\"no\":\"TY00038\",\"name\":\"余东湖\"},\n" +
                "{\"no\":\"TY00039\",\"name\":\"吴兰\"},\n" +
                "{\"no\":\"TY00040\",\"name\":\"胡镇红\"},\n" +
                "{\"no\":\"TY00041\",\"name\":\"宋圣林\"},\n" +
                "{\"no\":\"TY00042\",\"name\":\"詹家景\"},\n" +
                "{\"no\":\"TY00043\",\"name\":\"许凌强\"},\n" +
                "{\"no\":\"TY00044\",\"name\":\"夏宇恒\"},\n" +
                "{\"no\":\"TY00045\",\"name\":\"许凌玉\"},\n" +
                "{\"no\":\"TY00046\",\"name\":\"汪月霞\"},\n" +
                "{\"no\":\"TY00047\",\"name\":\"徐锦军\"},\n" +
                "{\"no\":\"TY00048\",\"name\":\"张仁爱\"},\n" +
                "{\"no\":\"TY00049\",\"name\":\"王之检\"},\n" +
                "{\"no\":\"TY00050\",\"name\":\"张光宗\"},\n" +
                "{\"no\":\"TY00051\",\"name\":\"黄颖超\"},\n" +
                "{\"no\":\"TY00052\",\"name\":\"谭强\"},\n" +
                "{\"no\":\"TY00053\",\"name\":\"周谟林\"},\n" +
                "{\"no\":\"TY00054\",\"name\":\"徐琳\"},\n" +
                "{\"no\":\"TY00055\",\"name\":\"周华栋\"},\n" +
                "{\"no\":\"TY00056\",\"name\":\"张光华\"},\n" +
                "{\"no\":\"TY00057\",\"name\":\"汪小英\"},\n" +
                "{\"no\":\"TY00058\",\"name\":\"徐育林\"},\n" +
                "{\"no\":\"TY00059\",\"name\":\"夏晓龙\"},\n" +
                "{\"no\":\"TY00060\",\"name\":\"李星星\"},\n" +
                "{\"no\":\"TY00061\",\"name\":\"朱正飞\"},\n" +
                "{\"no\":\"TY00062\",\"name\":\"洪建军\"},\n" +
                "{\"no\":\"TY00063\",\"name\":\"周左文\"},\n" +
                "{\"no\":\"TY00064\",\"name\":\"汪俊锋\"},\n" +
                "{\"no\":\"TY00065\",\"name\":\"李大江\"},\n" +
                "{\"no\":\"TY00066\",\"name\":\"汪林祥\"},\n" +
                "{\"no\":\"TY00067\",\"name\":\"杜传国\"},\n" +
                "{\"no\":\"TY00068\",\"name\":\"张军\"},\n" +
                "{\"no\":\"TY00069\",\"name\":\"章水根\"},\n" +
                "{\"no\":\"TY00070\",\"name\":\"沈永平\"},\n" +
                "{\"no\":\"TY00071\",\"name\":\"汪胜利\"},\n" +
                "{\"no\":\"TY00072\",\"name\":\"苏俊潇\"},\n" +
                "{\"no\":\"TY00073\",\"name\":\"徐柳根\"},\n" +
                "{\"no\":\"TY00074\",\"name\":\"田维仁\"},\n" +
                "{\"no\":\"TY00075\",\"name\":\"程后平\"},\n" +
                "{\"no\":\"TY00076\",\"name\":\"刘翔\"},\n" +
                "{\"no\":\"TY00077\",\"name\":\"方智鑫\"},\n" +
                "{\"no\":\"TY00078\",\"name\":\"严长凯\"},\n" +
                "{\"no\":\"TY00079\",\"name\":\"熊雷\"},\n" +
                "{\"no\":\"TY00080\",\"name\":\"郑彦俊\"},\n" +
                "{\"no\":\"TY00081\",\"name\":\"危欢\"},\n" +
                "{\"no\":\"TY00082\",\"name\":\"程晓栋\"},\n" +
                "{\"no\":\"TY00083\",\"name\":\"钟镕骏\"},\n" +
                "{\"no\":\"TY00084\",\"name\":\"刘玮\"},\n" +
                "{\"no\":\"TY00085\",\"name\":\"蓝天航\"},\n" +
                "{\"no\":\"TY00086\",\"name\":\"古佑强\"},\n" +
                "{\"no\":\"TY00087\",\"name\":\"肖立军\"},\n" +
                "{\"no\":\"TY00088\",\"name\":\"童广辉\"},\n" +
                "{\"no\":\"TY00089\",\"name\":\"曾凡样\"},\n" +
                "{\"no\":\"TY00090\",\"name\":\"李林康\"},\n" +
                "{\"no\":\"TY00091\",\"name\":\"程裕良\"},\n" +
                "{\"no\":\"TY00092\",\"name\":\"程宇文\"},\n" +
                "{\"no\":\"TY00093\",\"name\":\"丁光华\"},\n" +
                "{\"no\":\"TY00094\",\"name\":\"樊岍威\"},\n" +
                "{\"no\":\"TY00095\",\"name\":\"危发强\"},\n" +
                "{\"no\":\"TY00096\",\"name\":\"陈震宇\"},\n" +
                "{\"no\":\"TY00097\",\"name\":\"石治福\"},\n" +
                "{\"no\":\"TY00098\",\"name\":\"黄亦亮\"},\n" +
                "{\"no\":\"TY00099\",\"name\":\"张年老\"},\n" +
                "{\"no\":\"TY00100\",\"name\":\"朱佳星\"},\n" +
                "{\"no\":\"TY00101\",\"name\":\"李石俊\"},\n" +
                "{\"no\":\"TY00102\",\"name\":\"邹宇驰\"},\n" +
                "{\"no\":\"TY00103\",\"name\":\"刘小龙\"},\n" +
                "{\"no\":\"TY00104\",\"name\":\"周谟滔\"},\n" +
                "{\"no\":\"TY00105\",\"name\":\"傅赞明\"},\n" +
                "{\"no\":\"TY00106\",\"name\":\"朱合旺\"},\n" +
                "{\"no\":\"TY00107\",\"name\":\"何海贵\"},\n" +
                "{\"no\":\"TY00108\",\"name\":\"项国华\"},\n" +
                "{\"no\":\"TY00109\",\"name\":\"陈鹏\"},\n" +
                "{\"no\":\"TY00110\",\"name\":\"万立妹\"},\n" +
                "{\"no\":\"TY00111\",\"name\":\"万运来\"},\n" +
                "{\"no\":\"TY00112\",\"name\":\"朱想梅\"},\n" +
                "{\"no\":\"TY00113\",\"name\":\"江伟\"},\n" +
                "{\"no\":\"TY00114\",\"name\":\"曹明光\"},\n" +
                "{\"no\":\"TY00115\",\"name\":\"何猷笑\"},\n" +
                "{\"no\":\"TY00116\",\"name\":\"江涛\"},\n" +
                "{\"no\":\"TY00117\",\"name\":\"王涛\"},\n" +
                "{\"no\":\"TY00118\",\"name\":\"吴德富\"},\n" +
                "{\"no\":\"TY00119\",\"name\":\"张康文\"},\n" +
                "{\"no\":\"TY00120\",\"name\":\"程登宇\"},\n" +
                "{\"no\":\"TY00121\",\"name\":\"徐剑海\"},\n" +
                "{\"no\":\"TY00122\",\"name\":\"王典碧\"},\n" +
                "{\"no\":\"TY00123\",\"name\":\"刘先慧\"},\n" +
                "{\"no\":\"TY00124\",\"name\":\"程俊斌\"},\n" +
                "{\"no\":\"TY00125\",\"name\":\"丁胜华\"},\n" +
                "{\"no\":\"TY00126\",\"name\":\"李红海\"},\n" +
                "{\"no\":\"TY00127\",\"name\":\"葛银保\"},\n" +
                "{\"no\":\"TY00128\",\"name\":\"余俊\"},\n" +
                "{\"no\":\"TY00129\",\"name\":\"张黔梅\"},\n" +
                "{\"no\":\"TY00130\",\"name\":\"陈拥军\"},\n" +
                "{\"no\":\"TY00131\",\"name\":\"李咸斌\"},\n" +
                "{\"no\":\"TY00132\",\"name\":\"张新丽\"},\n" +
                "{\"no\":\"TY00133\",\"name\":\"王思刚\"},\n" +
                "{\"no\":\"TY00134\",\"name\":\"舒秦龙\"},\n" +
                "{\"no\":\"TY00135\",\"name\":\"赵如意\"},\n" +
                "{\"no\":\"TY00136\",\"name\":\"汪有强\"},\n" +
                "{\"no\":\"TY00137\",\"name\":\"韩忠新\"},\n" +
                "{\"no\":\"TY00138\",\"name\":\"韩淦\"},\n" +
                "{\"no\":\"TY00139\",\"name\":\"徐建波\"},\n" +
                "{\"no\":\"TY00140\",\"name\":\"丁国栋\"},\n" +
                "{\"no\":\"TY00141\",\"name\":\"李英杰\"},\n" +
                "{\"no\":\"TY00142\",\"name\":\"葛懿\"},\n" +
                "{\"no\":\"TY00143\",\"name\":\"石志鹏\"},\n" +
                "{\"no\":\"TY00144\",\"name\":\"张金娥\"},\n" +
                "{\"no\":\"TY00145\",\"name\":\"虞童\"},\n" +
                "{\"no\":\"TY00146\",\"name\":\"邹鹏\"},\n" +
                "{\"no\":\"TY00147\",\"name\":\"苏金丽\"},\n" +
                "{\"no\":\"TY00148\",\"name\":\"郑志鹏\"},\n" +
                "{\"no\":\"TY00149\",\"name\":\"彭建\"},\n" +
                "{\"no\":\"TY00150\",\"name\":\"余雪云\"},\n" +
                "{\"no\":\"TY00151\",\"name\":\"刘波\"},\n" +
                "{\"no\":\"TY00152\",\"name\":\"刘洋\"},\n" +
                "{\"no\":\"TY00153\",\"name\":\"付文涛\"},\n" +
                "{\"no\":\"TY00154\",\"name\":\"李华昭\"},\n" +
                "{\"no\":\"TY00155\",\"name\":\"程厚阳\"},\n" +
                "{\"no\":\"TY00156\",\"name\":\"胡亮\"},\n" +
                "{\"no\":\"TY00157\",\"name\":\"邓敏\"},\n" +
                "{\"no\":\"TY00158\",\"name\":\"严命坤\"},\n" +
                "{\"no\":\"TY00159\",\"name\":\"黄亦龙\"},\n" +
                "{\"no\":\"TY00160\",\"name\":\"王章美\"},\n" +
                "{\"no\":\"TY00161\",\"name\":\"江鹏\"},\n" +
                "{\"no\":\"TY00162\",\"name\":\"刘光辉\"},\n" +
                "{\"no\":\"TY00163\",\"name\":\"虞涛\"},\n" +
                "{\"no\":\"TY00164\",\"name\":\"朱栋龙\"},\n" +
                "{\"no\":\"TY00165\",\"name\":\"黄父爱\"},\n" +
                "{\"no\":\"TY00166\",\"name\":\"陈亚军\"},\n" +
                "{\"no\":\"TY00167\",\"name\":\"王仁焱\"},\n" +
                "{\"no\":\"TY00168\",\"name\":\"曹煜\"},\n" +
                "{\"no\":\"TY00169\",\"name\":\"张志成\"},\n" +
                "{\"no\":\"TY00170\",\"name\":\"张志旗\"},\n" +
                "{\"no\":\"TY00171\",\"name\":\"金绍雷\"},\n" +
                "{\"no\":\"TY00172\",\"name\":\"李文洁\"},\n" +
                "{\"no\":\"TY00173\",\"name\":\"刘安春\"},\n" +
                "{\"no\":\"TY00174\",\"name\":\"陈妍\"},\n" +
                "{\"no\":\"TY00175\",\"name\":\"徐靖\"},\n" +
                "{\"no\":\"TY00176\",\"name\":\"江鸿洋\"},\n" +
                "{\"no\":\"TY00177\",\"name\":\"苏芳华\"},\n" +
                "{\"no\":\"TY00178\",\"name\":\"刘镇\"},\n" +
                "{\"no\":\"TY00179\",\"name\":\"张学成\"},\n" +
                "{\"no\":\"TY00180\",\"name\":\"方兴兴\"},\n" +
                "{\"no\":\"TY00181\",\"name\":\"侯美佳\"},\n" +
                "{\"no\":\"TY00182\",\"name\":\"陈典辉\"},\n" +
                "{\"no\":\"TY00183\",\"name\":\"詹家杰\"},\n" +
                "{\"no\":\"TY00184\",\"name\":\"沈长征\"},\n" +
                "{\"no\":\"TY00185\",\"name\":\"彭春辉\"},\n" +
                "{\"no\":\"TY00186\",\"name\":\"王添喜\"},\n" +
                "{\"no\":\"TY00187\",\"name\":\"侯木财\"},\n" +
                "{\"no\":\"TY00188\",\"name\":\"王金宝\"},\n" +
                "{\"no\":\"TY00189\",\"name\":\"苏珍生\"},\n" +
                "\n" +
                "]";


        JSONArray jsonArray = JSONUtil.parseArray(json);
        for (Object o : jsonArray) {
            JSONObject jsonObject = (JSONObject) o;
            String no = (String) jsonObject.get("no");
            String namename = (String) jsonObject.get("name");

            File file = new File("D:\\ty20200912\\人脸图片文件");
            File[] files = file.listFiles();
            for (File f : files) {
                String name = f.getName().replace(".jpg", "");
                if (name.equals(namename)) {
                    System.out.println(no + " " + namename + " " + name);
                    System.out.println(f.renameTo(new File(f.getParent() + "\\" + no + "_" + namename + ".jpg")));
                }
            }
        }

    }
}
